1c/configuration/InformationRegisters/ТУРВ_ОчередьОбменаПроизвольнымиДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТУРВ_ОчередьОбменаПроизвольнымиДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТУРВ_СтатусОбменаСЛК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипОбъкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТУРВ_ВидыСобытийСОбъектамиЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХЭШ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/configuration/Enums/ТУРВ_ВидыСобытийСОбъектамиЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТУРВ_ВидыСобытийСОбъектамиЛК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/configuration/Enums/ТУРВ_СтатусОбменаСЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТУРВ_СтатусОбменаСЛК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/configuration/InformationRegisters/ТУРВ_ОчередьОбменаПроизвольнымиДанными/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Область РегистрацияДанных

Процедура ЗарегистрироватьДобавлениеОбъекта(ТипОбъкта, ИмяОбъекта, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи             = РегистрыСведений.ТУРВ_ОчередьОбменаПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъкта   = ТипОбъкта;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Добавление;
	МенеджерЗаписи.ХЭШ         = ХЭШ;
	МенеджерЗаписи.Статус      = Перечисления.ТУРВ_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.Данные      = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.ИмяОбъекта  = ИмяОбъекта;
	
	Попытка
		МенеджерЗаписи.Записать();
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,	
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта,
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьДобавлениеОбъекта"));

	Исключение
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта,
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьДобавлениеОбъекта",
																				ОписаниеОшибки()));
	КонецПопытки;

КонецПроцедуры

Процедура ЗарегистрироватьИзменениеОбъекта(ТипОбъкта, ИмяОбъекта, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи             = РегистрыСведений.ТУРВ_ОчередьОбменаПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъкта    = ТипОбъкта;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.ХЭШ         = ХЭШ;
	МенеджерЗаписи.Статус      = Перечисления.ТУРВ_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.Данные      = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.ИмяОбъекта  = ИмяОбъекта;
	
	Попытка
		МенеджерЗаписи.Записать();

		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,	
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьИзменениеОбъекта"));
	Исключение
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьИзменениеОбъекта",
																				ОписаниеОшибки()));
	КонецПопытки;
		
КонецПроцедуры

Процедура ЗарегистрироватьУдалениеОбъекта(ТипОбъкта, ИмяОбъекта, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи             = РегистрыСведений.ТУРВ_ОчередьОбменаПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъкта    = ТипОбъкта;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Удаление;
	МенеджерЗаписи.ХЭШ         = ХЭШ;
	МенеджерЗаписи.Статус      = Перечисления.ТУРВ_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.Данные      = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.ИмяОбъекта  = ИмяОбъекта;
	
	Попытка	
		МенеджерЗаписи.Записать();
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,	
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьУдалениеОбъекта"));
	Исключение
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьУдалениеОбъекта",
																				ОписаниеОшибки()));
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти

#Область ИзменениеСтатуса

Процедура ЗарегистрироватьОшибкуОбработки(ИД, ТипОбъкта, ИмяОбъекта, ВидСобытия, ХЭШ, Данные, МестоВозникновения = "", Ошибка = "") Экспорт 
	
	МенеджерЗаписи             = РегистрыСведений.ТУРВ_ОчередьОбменаПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъкта    = ТипОбъкта;
	МенеджерЗаписи.ВидСобытия  = ВидСобытия;
	МенеджерЗаписи.ХЭШ         = ХЭШ;
	МенеджерЗаписи.Статус      = Перечисления.ТУРВ_СтатусОбменаСЛК.Ошибка;
	МенеджерЗаписи.Данные      = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.ИД          = ИД;
	МенеджерЗаписи.ИмяОбъекта  = ИмяОбъекта;

	Попытка
		МенеджерЗаписи.Записать();
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				МестоВозникновения,
																				Ошибка));
	Исключение
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТипОбъкта,
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьОшибкуОбработки",
																				ОписаниеОшибки()));
	КонецПопытки;
		
КонецПроцедуры

Процедура ЗарегистрироватьУспехОбработки(ИД, ТипОбъкта, ИмяОбъекта, ВидСобытия, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи             = РегистрыСведений.ТУРВ_ОчередьОбменаПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъкта    = ТипОбъкта;
	МенеджерЗаписи.ВидСобытия  = ВидСобытия;
	МенеджерЗаписи.ХЭШ         = ХЭШ;
	МенеджерЗаписи.Статус      = Перечисления.ТУРВ_СтатусОбменаСЛК.Выполнен;
	МенеджерЗаписи.Данные      = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.ИД		   = ИД;
	МенеджерЗаписи.ИмяОбъекта  = ИмяОбъекта;

	Попытка	
		МенеджерЗаписи.Записать();
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,	
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьУдалениеОбъекта"));	
	Исключение
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьУспехОбработки",
																				ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
